{
    "scenarios": [
        {
            "scenario": "A project team is conducting sprint planning. Based on the estimated effort, only 95% of the items included in the sprint may be delivered. The product owner asks the project manager for advice on how to prioritize the backlog items. What should be used to prioritize the backlog items?",
            "process_group": "Planning",
            "knowledge_area": "Scope Management"
        },
        {
            "scenario": "A project manager is planning a project with multiple work packages. Each work package has its own defined scope, but funding will be at the project level. How should the project manager determine if the allocated resource budget is sufficient to cover the resource costs of the project?",
            "process_group": "Planning",
            "knowledge_area": "Cost Management"
        },
        {
            "scenario": "A company just started managing a project using an agile approach. Due to this change, the general manager is worried about the scope definition process for upcoming projects. What should the project manager do to ensure the project scope is completely defined?",
            "process_group": "Planning",
            "knowledge_area": "Scope Management"
        },
        {
            "scenario": "In a financial company, a strategic project has been planned to use a predictive approach. During project planning, the product leader requests that milestones be submitted for review. There is a defined scope and an established deadline to conclude the project. What should the project manager do first to meet the product leader's expectations?",
            "process_group": "Planning",
            "knowledge_area": "Schedule Management"
        },
        {
            "scenario": "A project scope statement has been approved, and the project manager and core team have been assigned to the project. Suddenly, the project manager takes a temporary leave of absence due to a medical emergency. The team develops the project schedule while the project manager is on leave. When the project manager returns, a detailed schedule is almost complete. What should the project manager do?",
            "process_group": "Planning",
            "knowledge_area": "Schedule Management"
        },
        {
            "scenario": "A laboratory is launching a new product, defined to be executed in eight iterations with a fixed release date. At the beginning of the second iteration, the project manager realizes that a significant regulatory feature is missing in the project backlog. What should the project manager do?",
            "process_group": "Planning",
            "knowledge_area": "Scope Management"
        },
        {
            "scenario": "In the past year, a company paid US$60,000 to an external subcontractor for an ongoing project. The project manager has been asked to evaluate if the project can be delivered more cost effectively this year by using internal labor. The project manager used an optimistic term of 4 months, a pessimistic term of 6 months, and a most expected term of 5 months, and has concluded that the service can be delivered with the following resources: * Two engineers (monthly salary of US$700 each) * One project manager (monthly salary of US$1,600) * Additional estimated monthly expenses of US$2,000 The project manager used the program evaluation and review technique (PERT) to calculate the savings if the project is delivered with in-house resources. How much money will the project manager estimate the company can save?",
            "process_group": "Planning",
            "knowledge_area": "Cost Management"
        },
        {
            "scenario": "A project manager is leading a technically complex project. The project is part of a strategic program of work and the first to use an agile approach. One of the board members is interested in attending a meeting to see how the delivery of the project scope is progressing. What should the project lead do?",
            "process_group": "Planning",
            "knowledge_area": "Communications Management"
        }
    ]
} 